////////////////////////////////////////////////////////////////////////////////
// зс_веб_ОбменДаннымиИмпорт: процедуры и функции импорта данных с сайта
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИсправитьНекорректныеСимволыВТекстеФайлаОбмена(ТекстФайла) Экспорт
	
	Амперсанд 	= Символ(38);
	Кавычка 	= Символ(34);
	Меньше 		= Символ(60);
	Больше 		= Символ(62);
	Апостроф 	= Символ(39);
	
	ЭкранированныйАмперсанд = "&amp;";
	ЭкранированнаяКавычка 	= "&quot;";
	ЭкранированныйМеньше 	= "&lt;";
	ЭкранированныйБольше 	= "&gt;";
	ЭкранированныйАпостроф 	= "&apos;";
	
	МассивНекорретныхСимволов = Новый Массив;
	
	МассивНекорретныхСимволов.Добавить(Новый Структура("Символ, ЭкранированныйСимвол, Идентификатор", 
														Амперсанд, ЭкранированныйАмперсанд, Строка(Новый УникальныйИдентификатор)));
														
	МассивНекорретныхСимволов.Добавить(Новый Структура("Символ, ЭкранированныйСимвол, Идентификатор", 
														Кавычка, ЭкранированнаяКавычка, Строка(Новый УникальныйИдентификатор)));
														
	МассивНекорретныхСимволов.Добавить(Новый Структура("Символ, ЭкранированныйСимвол, Идентификатор", 
														Меньше, ЭкранированныйМеньше, Строка(Новый УникальныйИдентификатор)));
														
	МассивНекорретныхСимволов.Добавить(Новый Структура("Символ, ЭкранированныйСимвол, Идентификатор", 
														Больше, ЭкранированныйБольше, Строка(Новый УникальныйИдентификатор)));
														
	МассивНекорретныхСимволов.Добавить(Новый Структура("Символ, ЭкранированныйСимвол, Идентификатор", 
														Апостроф, ЭкранированныйАпостроф, Строка(Новый УникальныйИдентификатор)));


	// сначала заменим экранированные символы на идентификаторы
	Для каждого НекорректныйСимвол Из МассивНекорретныхСимволов Цикл
		
		ТекстФайла = СтрЗаменить(ТекстФайла, НекорректныйСимвол.ЭкранированныйСимвол, НекорректныйСимвол.Идентификатор);
	
	КонецЦикла;
	
	// потом заменим оставшиеся неэкранированные символы на экранированные
	Для каждого НекорректныйСимвол Из МассивНекорретныхСимволов Цикл
		
		ТекстФайла = СтрЗаменить(ТекстФайла, НекорректныйСимвол.Символ, НекорректныйСимвол.ЭкранированныйСимвол);
	
	КонецЦикла;
	
	// и заменим идентификаторы на экранированные символы
	Для каждого НекорректныйСимвол Из МассивНекорретныхСимволов Цикл
		
		ТекстФайла = СтрЗаменить(ТекстФайла, НекорректныйСимвол.Идентификатор, НекорректныйСимвол.ЭкранированныйСимвол);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти