#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// todo
	// адаптировать загрузку внутренних данных
	
	//ПредставлениеВерсии = зс_веб_ВыгрузкаЗагрузкаВнутреннихДанныхЗетаВебСервер.ПолучитьПредставлениеНомераВерсии(Объект.Версия);
	
	зс_веб_ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Запросы, "ОбъектОбмена", Объект.Ссылка, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОбъектаПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеПриИзменении(Элемент)
	
	ТекстВопроса = "Объект будет снят с поддержки. Автоматическое обновление объекта будет невозможно. Продолжить?";
	Кнопки = РежимДиалогаВопрос.ДаНет;
	ОтветПоУмолчанию = КодВозвратаДиалога.Нет;
	ПараметрыОповещения = Новый Структура;
	
	//асинхронное открытие включим в ЗВ 3.0
	//Оповещение = Новый ОписаниеОповещения("РазрешитьРедактирование", ЭтаФорма, ПараметрыОповещения);
	//
	//ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , ОтветПоУмолчанию);	
											
	Ответ = Вопрос(ТекстВопроса , Кнопки, 0, ОтветПоУмолчанию);
	РазрешитьРедактирование(Ответ, ПараметрыОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Запросы

&НаКлиенте
Процедура ЗапросыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Создание структуры значений
	СтруктураФормы = Новый Структура;
	СтруктураФормы.Вставить("ОбъектОбмена", Объект.Ссылка);
	
	// Если запись не будет найдена, вызовем заполнение измерений.
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("ЗначенияЗаполнения", СтруктураФормы);
	
	ОткрытьФорму("РегистрСведений.зс_веб_ЗапросыОбъектовОбмена.Форма.ФормаЗаписи", СтруктураЗаполнения, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СравнитьСРелизом(Команда)
	
	// todo
	// адаптировать загрузку внутренних данных
	
	//ДанныеРелиза = зс_веб_ВыгрузкаЗагрузкаВнутреннихДанныхЗетаВебСервер.ПолучитьДанныеОбъектаИзРелиза(Строка(Объект.Ссылка.УникальныйИдентификатор()), Объект.Версия);
	//
	//ДанныеОбъекта = зс_веб_ВыгрузкаЗагрузкаВнутреннихДанныхЗетаВебСервер.ПолучитьСериализованныеДанныеОбъекта(Объект.Ссылка);
	//
	//зс_веб_ВыгрузкаЗагрузкаВнутреннихДанныхЗетаВебКлиент.СравнитьОбъекты(ДанныеРелиза, ДанныеОбъекта, "Данные релиза", "Данные объекта");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура УстановитьВидимостьДоступность()

	Если Объект.НаПоддержке Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		
		РазрешитьРедактирование = Ложь;
		
		Элементы.РазрешитьРедактирование.Заголовок = "Включить возможность редактирования";
	
		Элементы.СравнитьСРелизом.Доступность = Ложь;
		
	Иначе
		
		ЭтаФорма.ТолькоПросмотр = Ложь;
		
		РазрешитьРедактирование = Истина;

		Элементы.РазрешитьРедактирование.Заголовок = "Редактирование разрешено";
		Элементы.РазрешитьРедактирование.Доступность = Ложь;
		
		Элементы.СравнитьСРелизом.Доступность = Истина;
	
	КонецЕсли;
	
КонецПроцедуры // УстановитьВидимостьДоступность()

&НаКлиенте
Процедура РазрешитьРедактирование(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		
		РазрешитьРедактирование = Ложь;
		
		Возврат;
		
	КонецЕсли;
	
	Объект.НаПоддержке = Ложь;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

