////////////////////////////////////////////////////////////////////////////////
// зс_веб_ОбменДаннымиПовтИсп - процедуры и функции для обеспечения обмена с сайтом (кеширование)
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьУзлыПланаОбменаПоИмениМетаданных(ИмяМетаданных) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяМетаданных", ИмяМетаданных); 
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	зс_веб_ОбменДаннымиЗетаWeb.Ссылка КАК УзелПланаОбмена
	|ИЗ
	|	ПланОбмена.зс_веб_ОбменДаннымиЗетаWeb КАК зс_веб_ОбменДаннымиЗетаWeb
	|ГДЕ
	|	зс_веб_ОбменДаннымиЗетаWeb.ИмяМетаданных = &ИмяМетаданных
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	зс_веб_ОбменДаннымиКонфигурация.Ссылка
	|ИЗ
	|	ПланОбмена.зс_веб_ОбменДаннымиКонфигурация КАК зс_веб_ОбменДаннымиКонфигурация
	|ГДЕ
	|	зс_веб_ОбменДаннымиКонфигурация.ИмяМетаданных = &ИмяМетаданных"
	;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		МассивУзловПланаОбмена = Новый Массив;
		
	Иначе
		
		МассивУзловПланаОбмена = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("УзелПланаОбмена");
		
	КонецЕсли;
	
	Возврат МассивУзловПланаОбмена;

КонецФункции // ПолучитьМассивУзловПланаОбмена()

Функция ПолучитьВидОсновнойКонфигурации() Экспорт
	
	Возврат Константы.зс_веб_Конфигурация.Получить();
	
КонецФункции

Функция ПолучитьПрефиксСсылочногоТипа(Ссылка) Экспорт

	ТипСсылки = ТипЗнч(Ссылка);
	
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		
		ПрефиксТипа = "Спр";
		
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		
		ПрефиксТипа = "Док";
		
	ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипСсылки) Тогда
		
		ПрефиксТипа = "ПВХ"
		
	Иначе
		
		ПрефиксТипа = "";
		
	КонецЕсли;
	
	Возврат ПрефиксТипа;
	
КонецФункции

Функция ПолучитьИмяМетаданных(Ссылка) Экспорт
	
	Возврат Ссылка.Метаданные().Имя;

КонецФункции

Функция ПолучитьУзелПланаОбменаПоВидуКонфигурации(ВидКонфигурации) Экспорт
	
	Если ВидКонфигурации = Справочники.ЗетаWEBВидыКонфигураций.ЗетаWEB Тогда
		
		Возврат ПланыОбмена.зс_веб_ОбменДаннымиЗетаWeb.НайтиПоНаименованию("ZetaWeb");
		
	Иначе
		
		Возврат ПланыОбмена.зс_веб_ОбменДаннымиКонфигурация.НайтиПоНаименованию("ZetaWeb");
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
