
#Область ОбработчикиСобытийФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОбменССайтом(Команда)
	
	ВыполнитьОбменПоТекущимДанным();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузкуНаСайт(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		зс_веб_ОбменДаннымиВыгрузка.ВыгрузитьДанныеПоНастройкеОбмена(ТекущиеДанные.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуССайта(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		зс_веб_ОбменДаннымиЗагрузка.ЗагрузитьДанныеПоНастройкеОбмена(ТекущиеДанные.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПереносНастроекОбмена(Команда)
	
	ПеренестиНастройкиОбмена();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ВыполнитьОбменПоТекущимДанным()

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		зс_веб_ОбменДаннымиОбщий.ВыполнитьОбмен(ТекущиеДанные.Ссылка);
		
	КонецЕсли;

КонецПроцедуры // ВыполнитьОбменПоТекущимДанным()

#Область ПереносНастроекОбменаИзПервойВерсииВоВторую

&НаСервереБезКонтекста
Функция ПолучитьНастройкуОбмена(ИсходнаяНастройка)
	
	Если НЕ ЗначениеЗаполнено(ИсходнаяНастройка) Тогда
		
		Возврат Справочники.зс_веб_НастройкиОбмена.ПустаяСсылка();
		
	КонецЕсли;
	
	НаименованиеНастройки = ИсходнаяНастройка.Наименование;
	
	Настройка = Справочники.зс_веб_НастройкиОбмена.НайтиПоНаименованию(НаименованиеНастройки, Истина);
	
	Если ЗначениеЗаполнено(Настройка) Тогда
		
		Возврат Настройка;
		
	Иначе

		НоваяНастройка = Справочники.зс_веб_НастройкиОбмена.СоздатьЭлемент();
		
		ЗаполнитьЗначенияСвойств(НоваяНастройка, ИсходнаяНастройка, , "Код, Владелец");
		
		НоваяНастройка.Записать();
		
		Возврат НоваяНастройка.Ссылка;
		
	КонецЕсли;

КонецФункции // ПолучитьНастройкуПолногоОбмена()

&НаСервереБезКонтекста
Процедура ПеренестиНастройкиОбмена()
	
	НоваяНастройка = Справочники.зс_веб_НастройкиОбмена.ОсновнойВыгрузкаИзменений.ПолучитьОбъект();
	ИсходнаяНастройка = Справочники.ЗетаWEBНастройкиОбмена.ОсновнойВвыгрузкаИзменений;
	
	ЗаполнитьЗначенияСвойств(НоваяНастройка, ИсходнаяНастройка, , "Код, Владелец");
	
	НоваяНастройка.Записать();	
	
	НаборЗаписейСтарыеЗапросы = РегистрыСведений.ЗетаWEBЗначенияНастроекОбмена.СоздатьНаборЗаписей();
	НаборЗаписейСтарыеЗапросы.Прочитать();
	
	ТаблицаЗаписей = НаборЗаписейСтарыеЗапросы.Выгрузить();
	ТаблицаЗаписей.Колонки.Добавить("ОбъектОбмена");
	ТаблицаЗаписей.Колонки.Настройка.Имя = "СтараяНастройка";
	ТаблицаЗаписей.Колонки.Добавить("Настройка");
	
	МассивСтрокКУдалению = Новый Массив;
	
	Для каждого СтрокаЗаписи Из ТаблицаЗаписей Цикл
	
		СтрокаЗаписи.ОбъектОбмена = Справочники.зс_веб_ОбъектыОбмена.НайтиПоРеквизиту("ИдентификаторОбъектаКонфигурации", СтрокаЗаписи.ОбъектКонфигурации.УникальныйИдентификатор());
		
		Если СтрокаЗаписи.СтараяНастройка = Справочники.ЗетаWEBНастройкиОбмена.ОсновнойВвыгрузкаИзменений Тогда 
		
			СтрокаЗаписи.Настройка = Справочники.зс_веб_НастройкиОбмена.ОсновнойВыгрузкаИзменений;
			
		Иначе
			
			СтрокаЗаписи.Настройка = ПолучитьНастройкуОбмена(СтрокаЗаписи.СтараяНастройка);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаЗаписи.Настройка) ИЛИ НЕ ЗначениеЗаполнено(СтрокаЗаписи.ОбъектОбмена) ИЛИ СтрокаЗаписи.ОбъектОбмена.ЭтоГруппа Тогда
			
			МассивСтрокКУдалению.Добавить(СтрокаЗаписи);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого СтрокаЗаписи Из МассивСтрокКУдалению Цикл
	
		ТаблицаЗаписей.Удалить(СтрокаЗаписи);	
	
	КонецЦикла;
	
	НаборЗаписейНовыеЗапросы = РегистрыСведений.зс_веб_ЗначенияНастроекОбмена.СоздатьНаборЗаписей();
	
	НаборЗаписейНовыеЗапросы.Загрузить(ТаблицаЗаписей);
	
	НаборЗаписейНовыеЗапросы.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

