#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		ПроверитьПравильностьЗаполненияЗаписи(Запись);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьПравильностьЗаполненияЗаписи(Запись)
	
	// в запросе изменений должен быть параметр "&ПО1C2WEB"
	Если СтрНайти(ВРег(Запись.ЗапросИзменения), "&ПО1C2WEB") = 0 Тогда
		
		ВызватьИсключение "В запросе изменений должен быть параметр ""&ПО1C2WEB""";
		
	КонецЕсли;
	
	// если используются разделители обмена, то
	Если Запись.ИспользоватьРазделителиОбмена Тогда
	
		//	в запросе разделители изменений должен быть параметр "&ПО1C2WEB"
		Если СтрНайти(ВРег(Запись.ЗапросРазделителиИзменения), "&ПО1C2WEB") = 0 Тогда
			
			ВызватьИсключение "В запросе разделители изменений должен быть параметр ""&ПО1C2WEB""";
			
		КонецЕсли;
		
		//	в запросах разделителей должно быть поле "КАК РазделительОбмена"
		Если СтрНайти(ВРег(Запись.ЗапросРазделителиПолный), "КАК РАЗДЕЛИТЕЛЬОБМЕНА") = 0 Тогда
			
			ВызватьИсключение "В запросе разделители полный должно быть поле ""КАК РазделительОбмена""";
			
		КонецЕсли;
		
		Если СтрНайти(ВРег(Запись.ЗапросРазделителиИзменения), "КАК РАЗДЕЛИТЕЛЬОБМЕНА") = 0 Тогда
			
			ВызватьИсключение "В запросе разделители изменения должно быть поле ""КАК РазделительОбмена""";
			
		КонецЕсли;
		
		//	в условиях разделителей должен быть параметр &РазделительОбмена
		Если СтрНайти(ВРег(Запись.УсловиеРазделителяВПолномОбмене), "&РАЗДЕЛИТЕЛЬОБМЕНА") = 0 Тогда
			
			ВызватьИсключение "В условии разделителя для полного обмена должно быть поле ""КАК РазделительОбмена""";
			
		КонецЕсли;
		
		Если СтрНайти(ВРег(Запись.УсловиеРазделителяВОбменеИзменениями), "&РАЗДЕЛИТЕЛЬОБМЕНА") = 0 Тогда
			
			ВызватьИсключение "В условии разделителя для обмена изменениями должно быть поле ""КАК РазделительОбмена""";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти