
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(НаборКонстант.ЗетаWEBАдресСервисаОбменаДанными) Тогда
		
		НаборКонстант.ЗетаWEBАдресСервисаОбменаДанными = "http://site_name.ru/transferservice/transfer1c2web.asmx?WSDL";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	ОписаниеОшибки = "";
	
	Если зс_веб_ОбменДаннымиОбщий.СоздатьСервисОбменаССайтом( , ОписаниеОшибки) = Неопределено Тогда
		
		ТекстСообщения = ОписаниеОшибки;
		
	Иначе
		
		ТекстСоообщения = "Успешное подключение";
		
	КонецЕсли;
	
	зс_веб_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти